is1200-example-projects/mcb32tools/headers/proc/p32mz1024ech064.h
#define _UEFMODE_BRGH_POSITION                   0x00000003
#define _UEFMODE_BRGH_MASK                       0x00000008
#define _UEFMODE_BRGH_LENGTH                     0x00000001

#define _UEFMODE_RXINV_POSITION                  0x00000004
#define _UEFMODE_RXINV_MASK                      0x00000010
#define _UEFMODE_RXINV_LENGTH                    0x00000001

#define _UEFMODE_ABAUD_POSITION                  0x00000005
#define _UEFMODE_ABAUD_MASK                      0x00000020
#define _UEFMODE_ABAUD_LENGTH                    0x00000001

#define _UEFMODE_LPBACK_POSITION                 0x00000006
#define _UEFMODE_LPBACK_MASK                     0x00000040
#define _UEFMODE_LPBACK_LENGTH                   0x00000001

#define _UEFMODE_WAKE_POSITION                   0x00000007
#define _UEFMODE_WAKE_MASK                       0x00000080
#define _UEFMODE_WAKE_LENGTH                     0x00000001

#define _UEFMODE_UEN_POSITION                    0x00000008
#define _UEFMODE_UEN_MASK                        0x00000300
#define _UEFMODE_UEN_LENGTH                      0x00000002

#define _UEFMODE_RTSMD_POSITION                  0x0000000B
#define _UEFMODE_RTSMD_MASK                      0x00000800
#define _UEFMODE_RTSMD_LENGTH                    0x00000001

#define _UEFMODE_IREN_POSITION                   0x0000000C
#define _UEFMODE_IREN_MASK                       0x00001000
#define _UEFMODE_IREN_LENGTH                     0x00000001

#define _UEFMODE_SIDL_POSITION                   0x0000000D
#define _UEFMODE_SIDL_MASK                       0x00002000
#define _UEFMODE_SIDL_LENGTH                     0x00000001

#define _UEFMODE_ON_POSITION                     0x0000000F
#define _UEFMODE_ON_MASK                         0x00008000
#define _UEFMODE_ON_LENGTH                       0x00000001

#define _UEFMODE_PDSEL0_POSITION                 0x00000001
#define _UEFMODE_PDSEL0_MASK                     0x00000002
#define _UEFMODE_PDSEL0_LENGTH                   0x00000001

#define _UEFMODE_PDSEL1_POSITION                 0x00000002
#define _UEFMODE_PDSEL1_MASK                     0x00000004
#define _UEFMODE_PDSEL1_LENGTH                   0x00000001

#define _UEFMODE_UEN0_POSITION                   0x00000008
#define _UEFMODE_UEN0_MASK                       0x00000100
#define _UEFMODE_UEN0_LENGTH                     0x00000001

#define _UEFMODE_UEN1_POSITION                   0x00000009
#define _UEFMODE_UEN1_MASK                       0x00000200
#define _UEFMODE_UEN1_LENGTH                     0x00000001

#define _UEFMODE_USIDL_POSITION                  0x0000000D
#define _UEFMODE_USIDL_MASK                      0x00002000
#define _UEFMODE_USIDL_LENGTH                    0x00000001

#define _UEFMODE_UARTEN_POSITION                 0x0000000F
#define _UEFMODE_UARTEN_MASK                     0x00008000
#define _UEFMODE_UARTEN_LENGTH                   0x00000001

#define _UEFMODE_w_POSITION                      0x00000000
#define _UEFMODE_w_MASK                          0xFFFFFFFF
#define _UEFMODE_w_LENGTH                        0x00000020

#define _U3STA_URXDA_POSITION                    0x00000000
#define _U3STA_URXDA_MASK                        0x00000001
#define _U3STA_URXDA_LENGTH                      0x00000001

#define _U3STA_OERR_POSITION                     0x00000001
#define _U3STA_OERR_MASK                         0x00000002
#define _U3STA_OERR_LENGTH                       0x00000001

#define _U3STA_FERR_POSITION                     0x00000002
#define _U3STA_FERR_MASK                         0x00000004
#define _U3STA_FERR_LENGTH                       0x00000001

#define _U3STA_PERR_POSITION                     0x00000003
#define _U3STA_PERR_MASK                         0x00000008
#define _U3STA_PERR_LENGTH                       0x00000001

#define _U3STA_RIDLE_POSITION                    0x00000004
#define _U3STA_RIDLE_MASK                        0x00000010
#define _U3STA_RIDLE_LENGTH                      0x00000001

#define _U3STA_ADDEN_POSITION                    0x00000005
#define _U3STA_ADDEN_MASK                        0x00000020
#define _U3STA_ADDEN_LENGTH                      0x00000001

#define _U3STA_URXISEL_POSITION                  0x00000006
#define _U3STA_URXISEL_MASK                      0x000000C0
#define _U3STA_URXISEL_LENGTH                    0x00000002

#define _U3STA_TRMT_POSITION                     0x00000008
#define _U3STA_TRMT_MASK                         0x00000100
#define _U3STA_TRMT_LENGTH                       0x00000001

#define _U3STA_UTXBF_POSITION                    0x00000009
#define _U3STA_UTXBF_MASK                        0x00000200
#define _U3STA_UTXBF_LENGTH                      0x00000001

#define _U3STA_UTXEN_POSITION                    0x0000000A
#define _U3STA_UTXEN_MASK                        0x00000400
#define _U3STA_UTXEN_LENGTH                      0x00000001

#define _U3STA_UTXBRK_POSITION                   0x0000000B
#define _U3STA_UTXBRK_MASK                       0x00000800
#define _U3STA_UTXBRK_LENGTH                     0x00000001

#define _U3STA_URXEN_POSITION                    0x0000000C
#define _U3STA_URXEN_MASK                        0x00001000
#define _U3STA_URXEN_LENGTH                      0x00000001

#define _U3STA_UTXINV_POSITION                   0x0000000D
#define _U3STA_UTXINV_MASK                       0x00002000
#define _U3STA_UTXINV_LENGTH                     0x00000001

#define _U3STA_UTXISEL_POSITION                  0x0000000E
#define _U3STA_UTXISEL_MASK                      0x0000C000
#define _U3STA_UTXISEL_LENGTH                    0x00000002

#define _U3STA_ADDR_POSITION                     0x00000010
#define _U3STA_ADDR_MASK                         0x00FF0000
#define _U3STA_ADDR_LENGTH                       0x00000008

#define _U3STA_ADM_EN_POSITION                   0x00000018
#define _U3STA_ADM_EN_MASK                       0x01000000
#define _U3STA_ADM_EN_LENGTH                     0x00000001

#define _U3STA_URXISEL0_POSITION                 0x00000006
#define _U3STA_URXISEL0_MASK                     0x00000040
#define _U3STA_URXISEL0_LENGTH                   0x00000001

#define _U3STA_URXISEL1_POSITION                 0x00000007
#define _U3STA_URXISEL1_MASK                     0x00000080
#define _U3STA_URXISEL1_LENGTH                   0x00000001

#define _U3STA_UTXISEL0_POSITION                 0x0000000E
#define _U3STA_UTXISEL0_MASK                     0x00004000
#define _U3STA_UTXISEL0_LENGTH                   0x00000001

#define _U3STA_UTXISEL1_POSITION                 0x0000000F
#define _U3STA_UTXISEL1_MASK                     0x00008000
#define _U3STA_UTXISEL1_LENGTH                   0x00000001

#define _U3STA_UTXSEL_POSITION                   0x0000000E
#define _U3STA_UTXSEL_MASK                       0x0000C000
#define _U3STA_UTXSEL_LENGTH                     0x00000002

#define _U3STA_w_POSITION                        0x00000000
#define _U3STA_w_MASK                            0xFFFFFFFF
#define _U3STA_w_LENGTH                          0x00000020

#define _UEFSTA_URXDA_POSITION                   0x00000000
#define _UEFSTA_URXDA_MASK                       0x00000001
#define _UEFSTA_URXDA_LENGTH                     0x00000001

